Repository: siteddv/EskholFitness
Catalog: EskholFitness.CMD/Languages/Messages.*.resx
Languages: ru_ru

# ActionChoice_msg1
source: What do you want to do?
ru_ru: Что Вы хотите сделать?

# ActionChoice_msg2
source: e-enter a new meal.
ru_ru: e - ввести новый прием пищи.

# ActionChoice_msg3
source: a - enter a new activity
ru_ru: a - ввести новую активность

# ActionChoice_msg4
source: any another key - exit the app
ru_ru: любая другая клавиша - выйти из приложения

# EnterBirthDate_msg
source: Enter your date of birth: (dd/mm/yyyy).
ru_ru: Введитe свою дату рождения: (dd/mm/yyyy)

# EnterdUser_msg
source: You entered a user with this data:
ru_ru: Вы ввели пользователя с такими данными:

# EnterGender_msg
source: Enter your gender:
ru_ru: Введитe свой пол:

# EnterHeight_msg
source: Enter your height:
ru_ru: Введитe свой рост:

# EnterName_msg
source: Enter your name:
ru_ru: Введитe свое имя:

# EnterProductName_msg
source: Enter the product name:
ru_ru: Введите наименование продукта:

# EnterProductWeight_msg
source: Enter the weight of the portion:
ru_ru: Введите массу порции:

# EnterWeight_msg
source: Enter your weight:
ru_ru: Введитe свой вес:

# ErrorNullUserName
source: The user name cannot be empty or null.
ru_ru: Имя пользователя не может быть пустым или равным null.

# ReapeatGengerEntering_msg
source: Re-enter the gender. The gender name should not be empty.
ru_ru: Повторите ввод пола. Наименование пола не может быть пустым.

# ReapeatNameEntering_msg
source: Re-enter the name. The name cannot be empty.
ru_ru: Повторите ввод имени. Имя не может быть пусто.

# RepeatBirthDateEntering_msg
source: Re-enter your date of birth. The user cannot be over 120 years old or not yet born.
ru_ru: Повторите ввод даты рождения. Пользователь не может быть старше 120 лет или еще не родиться.

# RepeatHeightEntering_msg
source: Repeat entering growth:
ru_ru: Повторите ввод роста:

# RepeatProductNameEntering_msg
source: Re-enter the product name. The product name cannot be empty.
ru_ru: Повторите ввод наименования продукта. Наименование продукта не может быть пустым.

# RepeatProductWeight_msg
source: Repeat the entry. I couldn't convert it to a fractional number.
ru_ru: Повторите ввод. Не получилось преобразовать в дробное число.

# RepeatWeightEntering_msg
source: Re-enter the weight. The weight cannot be less than or equal to zero:
ru_ru: Повторите ввод веса. Вес не может быть меньше либо равным нулю:

# Saved_msg
source: Saved
ru_ru: Сохранено

# Welcoming_msg
source: You are welcome to the EskholFitness program!
ru_ru: Вас приветствует программа EskholFitness!
